src/testsuite/sysbench/results/oltp_write_only.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 396.23 qps: 2398.73 (r/w/o: 0.00/1602.00/796.73) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 411.70 qps: 2470.10 (r/w/o: 0.00/1646.70/823.40) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 451.55 qps: 2709.40 (r/w/o: 0.00/1806.30/903.10) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           99064
        other:                           49640
        total:                           148704
    transactions:                        24884  (413.39 per sec.)
    queries:                             148704 (2470.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      413.3875
    time elapsed:                        60.1955s
    total number of events:              24884

Latency (ms):
         min:                                   79.67
         avg:                                  310.15
         max:                                 1216.38
         95th percentile:                      612.21
         sum:                              7717882.75

Threads fairness:
    events (avg/stddev):           194.4062/2.08
    execution time (avg/stddev):   60.2960/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 769.85 qps: 4640.41 (r/w/o: 0.00/3096.45/1543.96) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 815.20 qps: 4891.02 (r/w/o: 0.00/3260.63/1630.39) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 846.90 qps: 5081.45 (r/w/o: 0.00/3387.65/1693.80) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           198668
        other:                           99462
        total:                           298130
    transactions:                        49795  (827.86 per sec.)
    queries:                             298130 (4956.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      827.8565
    time elapsed:                        60.1516s
    total number of events:              49795

Latency (ms):
         min:                                   66.64
         avg:                                  154.52
         max:                                  855.43
         95th percentile:                      207.82
         sum:                              7694076.03

Threads fairness:
    events (avg/stddev):           389.0234/1.45
    execution time (avg/stddev):   60.1100/0.01